# Analytical Element Set Transform Method

Source: https://www.revitapidocs.com/2026/a36c9fe3-38ed-65f3-62c6-45c41e086edb.htm

---

| Analytical Element Set Transform Method |
| --- |

Sets the transform of Analytical Element Local Coordinate System.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetTransform(
	Transform trf
)
```

```
Public Sub SetTransform (
	trf As Transform
)
```

```
public:
void SetTransform(
	Transform^ trf
)
```

```
member SetTransform :
        trf : Transform -> unit
```

#### Parameters

trf Transform

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The provided transformation for Local Coordinate System is not valid. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

AnalyticalElement Class Autodesk.Revit.DB.Structure Namespace